<?php
class Prints extends CI_Controller {
	public function __construct(){
		parent::__construct();

		$this->load->model('Report_model', 'report');
	}


    public function print_main_service($sv=''){
    	if(!isset($sv) || empty($sv)){
    		show_error('No service found.', 404);
    	}else{
            //get_main_service_detail($sv)
            $rs = $this->report->get_main_service_detail($sv);
            if($rs){
            	$this->load->library('pdf');
	            $this->pdf->setPrintHeader(false);
	            $this->pdf->setPrintFooter(false);
	            $this->pdf->setTopMargin(5);

	            // set document information
	            $this->pdf->SetSubject('AA Service');
	            $this->pdf->SetKeywords('AA Service');

	            // add a page
	            $this->pdf->AddPage();

	            // print a line using Cell()

	            /*select(array(
	            	's.*', 'p.product_serial','p.code as product_code',
	            	'p.name as product_name', 'o.name as owner_name',
	            	'u.fullname as request_name'))
		            	*/
	            $this->pdf->SetFont('freeserif', '', 12);
	            $html = '
	            <table border=0>
	            <tr>
	                <td><h4>โรงพยาบาลมหาสารคาม</h4></td>
	                <td><h1>ใบส่งซ่อม</h1></td>
	                <td>เลขที่: <b>'.$sv.'</b></td>
	            </tr>
	            <tr>
	                <td>หน่วยงาน: <b>'.$rs->owner_name.'</b> </td>
	                <td>โทรศัพท์ <b>-</b></td>
	                <td>วันที่  <b>'.to_thai_date($rs->date_serv).'</b></td>
	            </tr>
	            </table>
	            <hr>
	                <b>1. เรียน หน่วยงานซ่อมบำรุง</b>
	                &nbsp; &nbsp; &nbsp;  &nbsp; ด้วยฝ่าย/กลุ่มงาน มีความประสงค์ในการบริการซ่อมบำรุง ดังนี้  <br>
	                รายการที่ส่งซ่อม <b><u>'.$rs->product_name.'</u></b>  หมายเลขครุภัณฑ์ <b><u>'.$rs->product_code.'</u></b>
	                ยี่ห้อ <b><u> '.$rs->brand_name.' </u></b> รุ่น <b><u> '.$rs->model_name.' </u></b>  หมายเลขเครื่อง (Serial No.) <b><u> '.$rs->product_serial.' </u></b>
	                ซ่อมครั้งที่ _____ อาการเดิม _________________________ อาการแจ้งชำรุดครั้งนี้ <b><u> '.$rs->cause.' </u></b>
	                อายุการใช้งาน <b><u> '.$rs->age.' </u></b> ปี <br>
	                บริษัทผู้ขาย /  ที่อยู่ / เบอร์โทรศัพท์ <b><u> '.$rs->supplier_name.' </u></b>
	                <br>&nbsp; &nbsp; &nbsp;  &nbsp; จึงเรียนมาเพื่อโปรดพิจารณา
	                <div align="center">ผู้เสนอซ่อม.................................(ตัวบรรจง)</div>
	                <hr>
	                    ระยะเวลาในการซ่อมประมาณ...........วัน <br>
	                    เหตุผล...................................................................................................................................................................... <br>
	                    ข้อเสนอแนะ..............................................................................................................................................................<br>
	                <hr>
	                <p><b>2. เรียน ผู้อำนวยการโรงพยาบาลมหาสารคาม</b></p>
	                &nbsp; &nbsp; &nbsp;  &nbsp; ด้วยงานซ่อมบำรุงได้ประเมิณและตรวจสอบงานแล้วปรากฎว่า <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] อาการที่ชำรุด ...............................................................................................................................................<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] สาเหตุที่ชำรุด ...............................................................................................................................................<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ดำเนินการโดย .............................................................................................................................................<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ซื้ออะไหล่เพิ่มเติม คือ  ............................................................................................................................<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] แทงจำหน่าย <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] จัดจ้างให้พัสดุดำเนินการ <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ส่งเครื่องมือให้บริษัทแล้ว เมื่อวันที่............................ <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่ที่หน่วยงานส่งซ่อม แผนก............................ <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่แผนก ช่างซ่อมบำรุง ช่างบริษัทยังไม่ได้ตรวจสอบ<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่ที่หน่วยงานส่งซ่อม ช่างบริษัทตรวจสอบแล้ว วันที่............................ <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;  ช่างผู้รับผิดชอบ................................................. (ตัวบรรจง)<br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;  หัวหน้างาน..................................................... <br>
	                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;&nbsp;  &nbsp; &nbsp;  &nbsp;  &nbsp; (.................................................)
	                <hr>

	                <table border="0">
	                    <tr>
	                        <td>
	                        <b>3.</b> 3.1 ให้คณะกรรมการดังมีรายชื่อต่อไปนี้ทำการสืบราคา <br>
	                        1. .................................................................. <br>
	                        2. .................................................................. <br>
	                        3. .................................................................. <br>

	                        <b>ลงชื่อ.............................................................</b> <br>
	                        (.................................................................) <br>
	                        ประธานคณะกรรมการพิจารณางานซ่อมแซมและบำรุงรักษา
	                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
	                        3.3 เรียนผู้อำนวยการโรงพยาบาลมหาสารคามเพื่อโปรดพิจารณา <br>
	                        <b>ลงชื่อ.............................................................</b> <br>
	                        (.................................................................) <br>
	                        ประธานกรรมการพิจารณางานซ่อมแซมและบำรุงรักษา
	                        </td>
	                        <td>
	                        3.2 คณะกรรมการได้ทำการสืบราคาแล้วเห็นสมควร สั่งซื้อ/สั่งจ้าง ............................................................
	                        มาทำการซ่อมแซมงานดังกล่าวในราคา ......................... บาท <br>
	                        (.................................................................) <br>
	                        <b>ลงชื่อ.............................................................</b> <br>
	                        <b>ลงชื่อ.............................................................</b> <br>
	                        <b>ลงชื่อ.............................................................</b> <br>
	                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
	                        3.4 [ &nbsp; ] อนุมัติ &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; [ &nbsp; ] ไม่อนุมัติ <br>
	                        <b>ลงชื่อ.............................................................</b> <br>
	                        (.................................................................) <br>
	                        &nbsp; &nbsp; &nbsp;ผู้อำนวยการโรงพยาบาลมหาสารคาม  <br>
	                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
	                        </td>
	                    </tr>
	                </table>
	                <hr>
	                <p>วันงานแล้วเสร็จ................................&nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;
	                ผู้รับงาน........................................</p>
	                		<i style="font-size: 13px;">วันที่พิมพ์เอกสาร: '. to_thai_date(date('Y-m-d')) . ' เวลา ' . date('H:i:s') . '</i>';

	            $this->pdf->WriteHTML($html, true, false, true, false,'');

	            //Close and output PDF document
	            $this->pdf->Output($sv.'.pdf', 'I');
            }else{
            	show_error('No service found.', 404);
            }

    	}

    }

    public function print_other_service($sv=''){
    	if(!isset($sv) || empty($sv)){
    		show_error('No service found.', 404);
    	}else{
            //get_main_service_detail($sv)
            $rs = $this->report->get_other_service_detail($sv);

            $this->load->library('pdf');
            $this->pdf->setPrintHeader(false);
            $this->pdf->setPrintFooter(false);
            $this->pdf->setTopMargin(5);

            // set document information
            $this->pdf->SetSubject('AA Service');
            $this->pdf->SetKeywords('AA Service');

            // add a page
            $this->pdf->AddPage();

            // print a line using Cell()

            /*select(array(
            	's.*', 'p.product_serial','p.code as product_code',
            	'p.name as product_name', 'o.name as owner_name',
            	'u.fullname as request_name'))
	            	*/
            $this->pdf->SetFont('freeserif', '', 12);
            $html = '
            <table border=0>
            <tr>
                <td><h4>โรงพยาบาลมหาสารคาม</h4></td>
                <td><h1>ใบส่งซ่อม</h1></td>
                <td>เลขที่: <b>'.$sv.'</b></td>
            </tr>
            <tr>
                <td>หน่วยงาน: <b>'.$rs->owner_name.'</b> </td>
                <td>โทรศัพท์ <b>-</b></td>
                <td>วันที่  <b>'.to_thai_date($rs->date_serv).'</b></td>
            </tr>
            </table>
            <hr>
                <b>1. เรียน หน่วยงานซ่อมบำรุง</b>
                &nbsp; &nbsp; &nbsp;  &nbsp; ด้วยฝ่าย/กลุ่มงาน มีความประสงค์ในการบริการซ่อมบำรุง ดังนี้  <br>
                รายการที่ส่งซ่อม <b><u>'.$rs->product_name.'</u></b>  รายละเอียด <b><u>'.$rs->product_desc.'</u></b> หมายเลขครุภัณฑ์ <b><u> - </u></b>
                ยี่ห้อ <b><u> - </u></b> รุ่น <b><u> - </u></b>  หมายเลขเครื่อง (Serial No.) <b><u> - </u></b>
                ซ่อมครั้งที่ _____ อาการเดิม _____________________ อาการแจ้งชำรุดครั้งนี้ <b><u> '.$rs->cause.' </u></b>
                อายุการใช้งาน <b><u> - </u></b> ปี <br>
                บริษัทผู้ขาย /  ที่อยู่ / เบอร์โทรศัพท์ <b><u> - </u></b>
                <br>&nbsp; &nbsp; &nbsp;  &nbsp; จึงเรียนมาเพื่อโปรดพิจารณา
                <div align="center">ผู้เสนอซ่อม.................................(ตัวบรรจง)</div>
                <hr>
                    ระยะเวลาในการซ่อมประมาณ...........วัน <br>
                    เหตุผล...................................................................................................................................................................... <br>
                    ข้อเสนอแนะ..............................................................................................................................................................<br>
                <hr>
                <p><b>2. เรียน ผู้อำนวยการโรงพยาบาลมหาสารคาม</b></p>
                &nbsp; &nbsp; &nbsp;  &nbsp; ด้วยงานซ่อมบำรุงได้ประเมิณและตรวจสอบงานแล้วปรากฎว่า <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] อาการที่ชำรุด ...............................................................................................................................................<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] สาเหตุที่ชำรุด ...............................................................................................................................................<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ดำเนินการโดย .............................................................................................................................................<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ซื้ออะไหล่เพิ่มเติม คือ  ............................................................................................................................<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] แทงจำหน่าย <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] จัดจ้างให้พัสดุดำเนินการ <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] ส่งเครื่องมือให้บริษัทแล้ว เมื่อวันที่............................ <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่ที่หน่วยงานส่งซ่อม แผนก............................ <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่แผนก ช่างซ่อมบำรุง ช่างบริษัทยังไม่ได้ตรวจสอบ<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; [&nbsp; ] เครื่องอยู่ที่หน่วยงานส่งซ่อม ช่างบริษัทตรวจสอบแล้ว วันที่............................ <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;  ช่างผู้รับผิดชอบ................................................. (ตัวบรรจง)<br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;  หัวหน้างาน..................................................... <br>
                    &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp;  &nbsp;&nbsp;  &nbsp; &nbsp;  &nbsp;  &nbsp; (.................................................)
                <hr>

                <table border="0">
                    <tr>
                        <td>
                        <b>3.</b> 3.1 ให้คณะกรรมการดังมีรายชื่อต่อไปนี้ทำการสืบราคา <br>
                        1. .................................................................. <br>
                        2. .................................................................. <br>
                        3. .................................................................. <br>

                        <b>ลงชื่อ.............................................................</b> <br>
                        (.................................................................) <br>
                        ประธานคณะกรรมการพิจารณางานซ่อมแซมและบำรุงรักษา
                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
                        3.3 เรียนผู้อำนวยการโรงพยาบาลมหาสารคามเพื่อโปรดพิจารณา <br>
                        <b>ลงชื่อ.............................................................</b> <br>
                        (.................................................................) <br>
                        ประธานกรรมการพิจารณางานซ่อมแซมและบำรุงรักษา
                        </td>
                        <td>
                        3.2 คณะกรรมการได้ทำการสืบราคาแล้วเห็นสมควร สั่งซื้อ/สั่งจ้าง ............................................................
                        มาทำการซ่อมแซมงานดังกล่าวในราคา ......................... บาท <br>
                        (.................................................................) <br>
                        <b>ลงชื่อ.............................................................</b> <br>
                        <b>ลงชื่อ.............................................................</b> <br>
                        <b>ลงชื่อ.............................................................</b> <br>
                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
                        3.4 [ &nbsp; ] อนุมัติ &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; [ &nbsp; ] ไม่อนุมัติ <br>
                        <b>ลงชื่อ.............................................................</b> <br>
                        (.................................................................) <br>
                        &nbsp; &nbsp; &nbsp;ผู้อำนวยการโรงพยาบาลมหาสารคาม  <br>
                        &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; .........../.........../................... <br>
                        </td>
                    </tr>
                </table>
                <hr>
                <p>วันงานแล้วเสร็จ................................&nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; &nbsp; &nbsp;
                ผู้รับงาน........................................  </p>
                		<i style="font-size: 13px;">วันที่พิมพ์เอกสาร: '. to_thai_date(date('Y-m-d')) . ' เวลา ' . date('H:i:s') . '</i>';

            $this->pdf->WriteHTML($html, true, false, true, false,'');

            //Close and output PDF document
            $this->pdf->Output($sv . '.pdf', 'I');
    	}

    }
}